---
kind: method
id: M:Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor(Autodesk.Revit.DB.ExternalService.IExternalServer)
source: html/8a4478b4-6ffc-308b-7d1d-e5c1539b6f0a.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor Method

Create a new MEPCalculationServerInfo by an external server.

## Syntax (C#)
```csharp
public MEPCalculationServerInfo(
	IExternalServer server
)
```

## Parameters
- **server** (`Autodesk.Revit.DB.ExternalService.IExternalServer`) - The external server.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null